//Информация о JS
/*Нативный JS означает использование JS без стороних библиотек*/
/*
    В JS есть такой тип undefined. Не присвоив значение переменной
    получим значение undefined и typeof покажет тип 'undefined'

    NaN это не число, но typeof 'number'.

    Типизация - это то как код определяет разные типы. Число это Number и 
    т.д. Есть 'динамическая' типизация и 'статическая'
    
    Компиляция - это процесс конвертирования кода программой в удобный код для
    машины. Некоторые языки на стадии компиляции проверяют типизацию,
    такой процесс называеться 'статическая типизация',
    другие языки проверяют типы на стадии исполнения это 'динамическая типизация'
    Вообщем это означает что если возникает ошибка на моменте провеки 'статической типизации'
    программа не будет запущена, в то время как 'динамическая типизация'
    работает иначе, запускает программу и если в процессе работы будет не сходство типов
    тогда и будут вылетать ошибки.
    JS, Ruby, PHP - динамически типизированые языки

*/