/*
    360/(2*Math.PI) получаем 57 градусов или 1 радиане
    (2*Math.PI)/360 получаем какие то доли радиан в 1 градусе

    вычислить синус угла - альфа = противолежащий катет(а) / гипонетузу(h)
    вычислить косинус угла - альфа = подлежащий катет(b) / гипотенузу(h)
    //поменялись катеты, смысл всегда тот же синул это противолежащий катет, а косинус подлежащий
    вычислить с синус угла - бета = противолежащий катет(b) / гипонетузу(h)
    вычислить косинус угла - бета = подлежащий катет(а) / гипотенузу(h)

    c2 = a2 + b2
    c = Math.sqrt(  Math.pow(a, 2) + Math.pow(b, 2) )

   
*/